In [27]:
from sql_to_pandas import sql_to_dfs
import pandas as pd

# 176. Second Highest Salary

In [32]:
sql = {"headers": {"Employee": ["Id", "Salary"]}, "rows": {"Employee": [[1, 100], [2, 200], [3, 300]]}}

dfs_176 = sql_to_dfs(sql)

Write a SQL query to get the second highest salary from the Employee table.

+----+--------+
| Id | Salary |
+----+--------+
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |
+----+--------+

For example, given the above Employee table, the query should return 200 as the second highest salary. If there is no second highest salary, then the query should return null.

+---------------------+
| SecondHighestSalary |
+---------------------+
| 200                 |
+---------------------+

***

SELECT
    ( SELECT DISTINCT
            Salary 
        FROM
            Employee
        ORDER BY Salary DESC
        LIMIT 1 OFFSET 1) AS SecondHighestSalary
        
***

In [21]:
ret = None

try:
    ret = sorted(list(set(dfs_176[0].Salary)))[-2]
except:
    pass

ret

200

# 175. Combine Two Tables

In [22]:
sql = {"headers": {"Person": ["PersonId", "LastName", "FirstName"], "Address": ["AddressId", "PersonId", "City", "State"]}, "rows": {"Person": [[1, "Wang", "Allen"]], "Address": [[1, 2, "New York City", "New York"]]}}

dfs_175 = sql_to_dfs(sql)

Table: Person

+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| PersonId    | int     |
| FirstName   | varchar |
| LastName    | varchar |
+-------------+---------+
PersonId is the primary key column for this table.

Table: Address

+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| AddressId   | int     |
| PersonId    | int     |
| City        | varchar |
| State       | varchar |
+-------------+---------+
AddressId is the primary key column for this table.

 

Write a SQL query for a report that provides the following information for each person in the Person table, regardless if there is an address for each of those people:

FirstName, LastName, City, State

***

SELECT Person.FirstName, Person.LastName, Address.City, Address.State
From Person
LEFT JOIN Address
On Person.PersonId = Address.PersonId

***

In [30]:
pd.merge(dfs_175[0], dfs_175[1],
         how = 'left',
         left_on = 'PersonId',
         right_on = 'PersonId')[['FirstName', 'LastName', 'City', 'State']]

  FirstName LastName City State
0     Allen     Wang  NaN   NaN

# 183. Customers Who Never Order

In [31]:
sql = {"headers": {"Customers": ["Id", "Name"], "Orders": ["Id", "CustomerId"]}, "rows": {"Customers": [[1, "Joe"], [2, "Henry"], [3, "Sam"], [4, "Max"]], "Orders": [[1, 3], [2, 1]]}}

dfs_183 = sql_to_dfs(sql)

Suppose that a website contains two tables, the Customers table and the Orders table. Write a SQL query to find all customers who never order anything.

Table: Customers.

+----+-------+
| Id | Name  |
+----+-------+
| 1  | Joe   |
| 2  | Henry |
| 3  | Sam   |
| 4  | Max   |
+----+-------+

Table: Orders.

+----+------------+
| Id | CustomerId |
+----+------------+
| 1  | 3          |
| 2  | 1          |
+----+------------+

Using the above tables as example, return the following:

+-----------+
| Customers |
+-----------+
| Henry     |
| Max       |
+-----------+

***

SELECT Customers.Name AS Customers FROM Customers 
WHERE Customers.Id NOT IN (SELECT Orders.CustomerId from Orders)

***

In [42]:
dfs_183[0][pd.merge(dfs_183[0], dfs_183[1],
          how = 'left',
          left_on = 'Id', right_on = 'CustomerId').Id_y.isna()].Name

1    Henry
3      Max
Name: Name, dtype: object